# # py 피보나치 함수 소스코드

# def fibo(x):
#     if x == 1 or x == 2:
#         return 1
#     return fibo(x-1) + fibo(x-2)

# print(fibo(4))

# # 사용조건
# # 1. 큰 문제를 작은 문제로 나눌 수 있다
# # 2. 작은 문제에서 구한 정답은 그것을 포함하는 큰 문제에서도 동일하다.

# # # ----------------------------------------------------------------------------------

# # py 피보나치 수열 소스코드(재귀적)

# d = [0] * 100

# def fibo(x):
#     if x == 1 or x == 2:
#         return 1
    
#     if d[x] != 0:
#         return d[x]
    
#     d[x] = fibo(x-1) + fibo(x-2)

#     return d[x]

# print(fibo(99))

# # # ----------------------------------------------------------------------------------

# # py 호출되는 함수 확인

d = [0] * 100

def pibo(x):

    print('f('+str(x)+')')
    if x == 1 or x == 2:
        return 1
    
    if d[x] != 0:
        return d[x]
    
    d[x] = pibo(x-1) + pibo(x-2)

    return d[x]

pibo(6)

# # # ----------------------------------------------------------------------------------

# # py 피보나치 수열 소스코드(반복적)

# d = [0] * 100

# d[1] = 1
# d[2] = 1
# n = 99

# for i in range(3, n+1):
#     d[i] = d[i-1] + d[i-2]

# print(d[n])
